; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-2-3)
(:domain sobokosnake)
(:objects
    pos0-0 - location
    pos0-1 - location
    pos0-2 - location
    pos0-3 - location
    pos0-5 - location
    pos0-6 - location
    pos1-0 - location
    pos1-2 - location
    pos1-3 - location
    pos1-4 - location
    pos1-5 - location
    pos1-6 - location
    pos2-0 - location
    pos2-2 - location
    pos2-4 - location
    pos2-6 - location
    pos3-0 - location
    pos3-1 - location
    pos3-2 - location
    pos3-4 - location
    pos3-6 - location
    pos4-0 - location
    pos4-2 - location
    pos4-4 - location
    pos4-6 - location
    pos5-0 - location
    pos5-1 - location
    pos5-2 - location
    pos5-4 - location
    pos5-5 - location
    pos5-6 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-0 pos0-1 dir-right)
    (MOVE-DIR pos0-0 pos1-0 dir-down)
    (MOVE-DIR pos0-1 pos0-0 dir-left)
    (MOVE-DIR pos0-1 pos0-2 dir-right)
    (MOVE-DIR pos0-2 pos0-3 dir-right)
    (MOVE-DIR pos0-2 pos1-2 dir-down)
    (MOVE-DIR pos0-2 pos0-1 dir-left)
    (MOVE-DIR pos0-3 pos0-2 dir-left)
    (MOVE-DIR pos0-3 pos1-3 dir-down)
    (MOVE-DIR pos0-5 pos0-6 dir-right)
    (MOVE-DIR pos0-5 pos1-5 dir-down)
    (MOVE-DIR pos0-6 pos0-5 dir-left)
    (MOVE-DIR pos0-6 pos1-6 dir-down)
    (MOVE-DIR pos1-0 pos0-0 dir-up)
    (MOVE-DIR pos1-0 pos2-0 dir-down)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-2 pos2-2 dir-down)
    (MOVE-DIR pos1-2 pos0-2 dir-up)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos1-3 pos1-4 dir-right)
    (MOVE-DIR pos1-3 pos0-3 dir-up)
    (MOVE-DIR pos1-4 pos1-3 dir-left)
    (MOVE-DIR pos1-4 pos1-5 dir-right)
    (MOVE-DIR pos1-4 pos2-4 dir-down)
    (MOVE-DIR pos1-5 pos1-4 dir-left)
    (MOVE-DIR pos1-5 pos1-6 dir-right)
    (MOVE-DIR pos1-5 pos0-5 dir-up)
    (MOVE-DIR pos1-6 pos1-5 dir-left)
    (MOVE-DIR pos1-6 pos2-6 dir-down)
    (MOVE-DIR pos1-6 pos0-6 dir-up)
    (MOVE-DIR pos2-0 pos1-0 dir-up)
    (MOVE-DIR pos2-0 pos3-0 dir-down)
    (MOVE-DIR pos2-2 pos3-2 dir-down)
    (MOVE-DIR pos2-2 pos1-2 dir-up)
    (MOVE-DIR pos2-4 pos3-4 dir-down)
    (MOVE-DIR pos2-4 pos1-4 dir-up)
    (MOVE-DIR pos2-6 pos3-6 dir-down)
    (MOVE-DIR pos2-6 pos1-6 dir-up)
    (MOVE-DIR pos3-0 pos2-0 dir-up)
    (MOVE-DIR pos3-0 pos3-1 dir-right)
    (MOVE-DIR pos3-0 pos4-0 dir-down)
    (MOVE-DIR pos3-1 pos3-0 dir-left)
    (MOVE-DIR pos3-1 pos3-2 dir-right)
    (MOVE-DIR pos3-2 pos3-1 dir-left)
    (MOVE-DIR pos3-2 pos4-2 dir-down)
    (MOVE-DIR pos3-2 pos2-2 dir-up)
    (MOVE-DIR pos3-4 pos4-4 dir-down)
    (MOVE-DIR pos3-4 pos2-4 dir-up)
    (MOVE-DIR pos3-6 pos4-6 dir-down)
    (MOVE-DIR pos3-6 pos2-6 dir-up)
    (MOVE-DIR pos4-0 pos3-0 dir-up)
    (MOVE-DIR pos4-0 pos5-0 dir-down)
    (MOVE-DIR pos4-2 pos5-2 dir-down)
    (MOVE-DIR pos4-2 pos3-2 dir-up)
    (MOVE-DIR pos4-4 pos5-4 dir-down)
    (MOVE-DIR pos4-4 pos3-4 dir-up)
    (MOVE-DIR pos4-6 pos5-6 dir-down)
    (MOVE-DIR pos4-6 pos3-6 dir-up)
    (MOVE-DIR pos5-0 pos4-0 dir-up)
    (MOVE-DIR pos5-0 pos5-1 dir-right)
    (MOVE-DIR pos5-1 pos5-0 dir-left)
    (MOVE-DIR pos5-1 pos5-2 dir-right)
    (MOVE-DIR pos5-2 pos5-1 dir-left)
    (MOVE-DIR pos5-2 pos4-2 dir-up)
    (MOVE-DIR pos5-4 pos5-5 dir-right)
    (MOVE-DIR pos5-4 pos4-4 dir-up)
    (MOVE-DIR pos5-5 pos5-4 dir-left)
    (MOVE-DIR pos5-5 pos5-6 dir-right)
    (MOVE-DIR pos5-6 pos5-5 dir-left)
    (MOVE-DIR pos5-6 pos4-6 dir-up)
    (thinsnake pos1-2)
    (blocked pos1-2)
    (ispoint pos1-4)
    (ispoint pos1-5)
    (ispoint pos1-6)
    (ispoint pos3-0)
    (ispoint pos3-1)
    (ispoint pos3-2)
    (ispoint pos4-0)
    (ispoint pos4-2)
    (ispoint pos5-0)
    (ispoint pos5-1)
    (ispoint pos5-2)
    (ispoint pos5-4)
    (ispoint pos5-6)
    (isbox pos1-3)
)
(:goal
(and
    (not (ispoint pos1-4))
    (not (ispoint pos1-5))
    (not (ispoint pos1-6))
    (not (ispoint pos3-0))
    (not (ispoint pos3-1))
    (not (ispoint pos3-2))
    (not (ispoint pos4-0))
    (not (ispoint pos4-2))
    (not (ispoint pos5-0))
    (not (ispoint pos5-1))
    (not (ispoint pos5-2))
    (not (ispoint pos5-4))
    (not (ispoint pos5-6))
)
)
)

; plan
1. (move-thin-snake-and-box pos1-2 pos1-3 pos1-4 dir-right)
   deleted: (thinsnake pos1-2) (blocked pos1-2) (isbox pos1-3)
   added: (thinsnake pos1-3) (blocked pos1-3) (isbox pos1-4)
   goals met: 0 of 13
2. (move-box-and-first-eat pos1-3 pos1-4 pos1-5 dir-right)
   deleted: (ispoint pos1-4) (thinsnake pos1-3) (isbox pos1-4)
   added: (blocked pos1-4) (headsnake pos1-4) (tailsnake pos1-3) (nextsnake pos1-4 pos1-3) (isbox pos1-5)
   goals met: 1 of 13
3. (move-fat-snake pos1-4 pos2-4 pos1-3 pos1-4 dir-down)
   deleted: (headsnake pos1-4) (blocked pos1-3) (tailsnake pos1-3) (nextsnake pos1-4 pos1-3)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos1-4) (tailsnake pos1-4)
   goals met: 1 of 13
4. (move-fat-snake pos2-4 pos3-4 pos1-4 pos2-4 dir-down)
   deleted: (headsnake pos2-4) (blocked pos1-4) (tailsnake pos1-4) (nextsnake pos2-4 pos1-4)
   added: (blocked pos3-4) (headsnake pos3-4) (nextsnake pos3-4 pos2-4) (tailsnake pos2-4)
   goals met: 1 of 13
5. (move-fat-snake pos3-4 pos4-4 pos2-4 pos3-4 dir-down)
   deleted: (headsnake pos3-4) (blocked pos2-4) (tailsnake pos2-4) (nextsnake pos3-4 pos2-4)
   added: (blocked pos4-4) (headsnake pos4-4) (nextsnake pos4-4 pos3-4) (tailsnake pos3-4)
   goals met: 1 of 13
6. (move-and-eat pos4-4 pos5-4 dir-down)
   deleted: (headsnake pos4-4) (ispoint pos5-4)
   added: (blocked pos5-4) (headsnake pos5-4) (nextsnake pos5-4 pos4-4)
   goals met: 2 of 13
7. (move-fat-snake pos5-4 pos5-5 pos3-4 pos4-4 dir-right)
   deleted: (headsnake pos5-4) (blocked pos3-4) (tailsnake pos3-4) (nextsnake pos4-4 pos3-4)
   added: (blocked pos5-5) (headsnake pos5-5) (nextsnake pos5-5 pos5-4) (tailsnake pos4-4)
   goals met: 2 of 13
8. (move-and-eat pos5-5 pos5-6 dir-right)
   deleted: (headsnake pos5-5) (ispoint pos5-6)
   added: (blocked pos5-6) (headsnake pos5-6) (nextsnake pos5-6 pos5-5)
   goals met: 3 of 13
9. (move-fat-snake pos5-6 pos4-6 pos4-4 pos5-4 dir-up)
   deleted: (headsnake pos5-6) (blocked pos4-4) (tailsnake pos4-4) (nextsnake pos5-4 pos4-4)
   added: (blocked pos4-6) (headsnake pos4-6) (nextsnake pos4-6 pos5-6) (tailsnake pos5-4)
   goals met: 3 of 13
10. (move-fat-snake pos4-6 pos3-6 pos5-4 pos5-5 dir-up)
   deleted: (headsnake pos4-6) (blocked pos5-4) (tailsnake pos5-4) (nextsnake pos5-5 pos5-4)
   added: (blocked pos3-6) (headsnake pos3-6) (nextsnake pos3-6 pos4-6) (tailsnake pos5-5)
   goals met: 3 of 13
11. (move-fat-snake pos3-6 pos2-6 pos5-5 pos5-6 dir-up)
   deleted: (headsnake pos3-6) (blocked pos5-5) (tailsnake pos5-5) (nextsnake pos5-6 pos5-5)
   added: (blocked pos2-6) (headsnake pos2-6) (nextsnake pos2-6 pos3-6) (tailsnake pos5-6)
   goals met: 3 of 13
12. (move-and-eat pos2-6 pos1-6 dir-up)
   deleted: (headsnake pos2-6) (ispoint pos1-6)
   added: (blocked pos1-6) (headsnake pos1-6) (nextsnake pos1-6 pos2-6)
   goals met: 4 of 13
13. (move-box-and-eat pos1-6 pos1-5 pos1-4 dir-left)
   deleted: (headsnake pos1-6) (ispoint pos1-5) (isbox pos1-5)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos1-6) (isbox pos1-4)
   goals met: 5 of 13
14. (move-fat-snake-and-box pos1-5 pos1-4 pos5-6 pos4-6 pos1-3 dir-left)
   deleted: (headsnake pos1-5) (blocked pos5-6) (tailsnake pos5-6) (nextsnake pos4-6 pos5-6) (isbox pos1-4)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos1-5) (tailsnake pos4-6) (isbox pos1-3)
   goals met: 5 of 13
15. (move-fat-snake-and-box pos1-4 pos1-3 pos4-6 pos3-6 pos1-2 dir-left)
   deleted: (headsnake pos1-4) (blocked pos4-6) (tailsnake pos4-6) (nextsnake pos3-6 pos4-6) (isbox pos1-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos1-4) (tailsnake pos3-6) (isbox pos1-2)
   goals met: 5 of 13
16. (move-fat-snake pos1-3 pos0-3 pos3-6 pos2-6 dir-up)
   deleted: (headsnake pos1-3) (blocked pos3-6) (tailsnake pos3-6) (nextsnake pos2-6 pos3-6)
   added: (blocked pos0-3) (headsnake pos0-3) (nextsnake pos0-3 pos1-3) (tailsnake pos2-6)
   goals met: 5 of 13
17. (move-fat-snake pos0-3 pos0-2 pos2-6 pos1-6 dir-left)
   deleted: (headsnake pos0-3) (blocked pos2-6) (tailsnake pos2-6) (nextsnake pos1-6 pos2-6)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos0-3) (tailsnake pos1-6)
   goals met: 5 of 13
18. (move-fat-snake pos0-2 pos0-1 pos1-6 pos1-5 dir-left)
   deleted: (headsnake pos0-2) (blocked pos1-6) (tailsnake pos1-6) (nextsnake pos1-5 pos1-6)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos0-2) (tailsnake pos1-5)
   goals met: 5 of 13
19. (move-fat-snake pos0-1 pos0-0 pos1-5 pos1-4 dir-left)
   deleted: (headsnake pos0-1) (blocked pos1-5) (tailsnake pos1-5) (nextsnake pos1-4 pos1-5)
   added: (blocked pos0-0) (headsnake pos0-0) (nextsnake pos0-0 pos0-1) (tailsnake pos1-4)
   goals met: 5 of 13
20. (move-fat-snake pos0-0 pos1-0 pos1-4 pos1-3 dir-down)
   deleted: (headsnake pos0-0) (blocked pos1-4) (tailsnake pos1-4) (nextsnake pos1-3 pos1-4)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos0-0) (tailsnake pos1-3)
   goals met: 5 of 13
21. (move-fat-snake pos1-0 pos2-0 pos1-3 pos0-3 dir-down)
   deleted: (headsnake pos1-0) (blocked pos1-3) (tailsnake pos1-3) (nextsnake pos0-3 pos1-3)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos1-0) (tailsnake pos0-3)
   goals met: 5 of 13
22. (move-and-eat pos2-0 pos3-0 dir-down)
   deleted: (headsnake pos2-0) (ispoint pos3-0)
   added: (blocked pos3-0) (headsnake pos3-0) (nextsnake pos3-0 pos2-0)
   goals met: 6 of 13
23. (move-and-eat pos3-0 pos4-0 dir-down)
   deleted: (headsnake pos3-0) (ispoint pos4-0)
   added: (blocked pos4-0) (headsnake pos4-0) (nextsnake pos4-0 pos3-0)
   goals met: 7 of 13
24. (move-and-eat pos4-0 pos5-0 dir-down)
   deleted: (headsnake pos4-0) (ispoint pos5-0)
   added: (blocked pos5-0) (headsnake pos5-0) (nextsnake pos5-0 pos4-0)
   goals met: 8 of 13
25. (move-and-eat pos5-0 pos5-1 dir-right)
   deleted: (headsnake pos5-0) (ispoint pos5-1)
   added: (blocked pos5-1) (headsnake pos5-1) (nextsnake pos5-1 pos5-0)
   goals met: 9 of 13
26. (move-and-eat pos5-1 pos5-2 dir-right)
   deleted: (headsnake pos5-1) (ispoint pos5-2)
   added: (blocked pos5-2) (headsnake pos5-2) (nextsnake pos5-2 pos5-1)
   goals met: 10 of 13
27. (move-and-eat pos5-2 pos4-2 dir-up)
   deleted: (headsnake pos5-2) (ispoint pos4-2)
   added: (blocked pos4-2) (headsnake pos4-2) (nextsnake pos4-2 pos5-2)
   goals met: 11 of 13
28. (move-and-eat pos4-2 pos3-2 dir-up)
   deleted: (headsnake pos4-2) (ispoint pos3-2)
   added: (blocked pos3-2) (headsnake pos3-2) (nextsnake pos3-2 pos4-2)
   goals met: 12 of 13
29. (move-and-eat pos3-2 pos3-1 dir-left)
   deleted: (headsnake pos3-2) (ispoint pos3-1)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos3-2)
   goals met: 13 of 13
